mcheah/Marlin4MPMD/stm32_cube/Drivers/BSP/STM32F4xx-3dPrinter/stm32f4xx_3dprinter_wifi.c
/**
  ******************************************************************************
  * @file    stm32f4xx_3dPrinter_wifi.c
  * @author  IPC Rennes
  * @version V1.0.0
  * @date    January 29, 2015
  * @brief   wifi functions of 3D Printer BSP driver 
  *  (based on L6474)
  * @note    (C) COPYRIGHT 2015 STMicroelectronics
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_3dprinter_wifi.h"
#include "stm32f4xx_3dprinter_misc.h"
#include "stm32f4xx_3dprinter_uart.h"
#include "string.h"
#include <stdio.h>

/* Private defines -----------------------------------------------------------*/
#define WIFI_COMMAND_MODE     (0x00)
#define WIFI_DATA_MODE        (0x01)
#define WIFI_FILE_APPEND      (0x02)
#define WIFI_DATA_MODE_AND_GCODE_PARSER             (0x03)
#define WIFI_COMMAND_MODE_AND_GCODE_PARSER          (0x04)
#define WIFI_COMMAND_MODE_WEB_FILE_AND_GCODE_PARSER (WIFI_COMMAND_MODE_AND_GCODE_PARSER | 0x01)

#define WIFI_INPUT_CGI_DELAY                    (500)
#define WIFI_COMMAND_MODE_WEB_WRITE_TIMEOUT     (15000)

#define WIFI_FILE_CREATION_PENDING              (1)
#define WIFI_CONFIG_FS_UPDATE_PENDING           (3+WIFI_FILE_CREATION_PENDING)
#define WIFI_CONFIG_FS_UPDATE_START             (4+WIFI_FILE_CREATION_PENDING)
#define WIFI_CONFIG_FS_UPDATE_CONNECT           (5+WIFI_FILE_CREATION_PENDING)
#define WIFI_CONFIG_FS_UPDATE_CHECK             (6+WIFI_FILE_CREATION_PENDING)
#define WIFI_CONFIG_FS_UPDATE_PRINT_VERSION     (7+WIFI_FILE_CREATION_PENDING)
#define WIFI_CONFIG_FS_UPDATE                   (8+WIFI_FILE_CREATION_PENDING)
#define WIFI_CONFIG_SAVE_CASE                   (8+WIFI_CONFIG_FS_UPDATE)
#define WIFI_CONFIG_ITEMS                       (14)
#if defined(PROD_TEST)
#define WIFI_CONFIG_FW_UPDATE                   (WIFI_CONFIG_SAVE_CASE+WIFI_CONFIG_ITEMS+1)
#endif //#if defined(PROD_TEST)

/* Private constant ----------------------------------------------------------*/
#define WIFI_ERROR_TAG        (0x4000)
#define WIFI_ERROR(error)     BSP_MiscErrorHandler(error|WIFI_ERROR_TAG)

#define WIFI_UART_RX_BUFFER_SIZE                (512)
#define WIFI_UART_TX_BUFFER_SIZE (256)

#define WIFI_FILE_MAX_SIZE                      (4096)
#define WIFI_FILE_NAME_LENGTH                   (30)

#define WIFI_UART_GCODE_START_STRING "GcodesStart"
#define WIFI_UART_GCODE_STOP_STRING "GcodesStop"
#define WIFI_UART_FILE_WRITE_START_STRING "FileWriteStart"
//Two stop strings can occur depending on the wifi module firmware and mode
#define WIFI_UART_FILE_WRITE_STOP_STRING "+WIND:56:Insert message to client: FileWriteStop"
#define WIFI_UART_FILE_WRITE_STOP_STRING_1 "+WIND:56:Insert message to client:1: FileWriteStop"

/* Global variables ---------------------------------------------------------*/
BspWifiDataType gBspWifiData;
uint8_t gBspWifiUartRxBuffer[2*WIFI_UART_RX_BUFFER_SIZE];
uint8_t gBspWifiUartTxBuffer[2*WIFI_UART_TX_BUFFER_SIZE];
char previousString[256];

/* Private function -----------------------------------------------------------*/
static void BSP_WifiGpioInit(void);
static void BSP_WifiUartInit(uint32_t baudRate);
uint8_t BSP_WifiParseRxBytes(uint8_t offset, uint8_t nbBytes);
void BSP_WifiRestart(void);

#if defined(PROD_TEST)
/******************************************************//**
 * @brief  Wifi Hw initialisation
 * @param baudRate UART baud rate used between the main stm32
 * and the wifi module
 * @param ssid wifi module SSID
 * @param wepKey wifi module WEP KEY
 * @param fwVersionExpected expected version of the wifi module firmware
 * @param fsVersionExpected expected version of the wifi module file system
 * @retval None
 **********************************************************/
void BSP_WifiHwInit(uint32_t baudRate, char* ssid, char* wepKey, char* expectedFwVersion, char* expectedFsVersion)
{
  BspWifiDataType *pWifi = &gBspWifiData;
  
  strcpy(pWifi->ssid,ssid);
  strcpy(pWifi->wepKey,wepKey);
  strcpy(pWifi->expectedFwVersion,expectedFwVersion);
  strcpy(pWifi->expectedFsVersion,expectedFsVersion);
  BSP_WifiGpioInit();
  BSP_WifiUartInit(baudRate);
}
#else //#if defined(PROD_TEST)
/******************************************************//**
 * @brief  Wifi Hw initialisation
 * @param baudRate UART baud rate used between the main stm32
 * and the wifi module
 * @param ssid wifi module SSID
 * @param wepKey wifi module WEP KEY
 * @retval None
 **********************************************************/
void BSP_WifiHwInit(uint32_t baudRate, char* ssid, char* wepKey)
{
  BspWifiDataType *pWifi = &gBspWifiData;
  
